Repository: dev-longshun/glint
Catalog: Glint/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: "%@" is not executable.
zh_hans: "%@" 不是可执行文件。

source: %@ failed (exit %lld).
zh_hans: %@ 失败（退出码 %lld）。

source: %@ failed (exit %lld): %@
zh_hans: %@ 失败（退出码 %lld）：%@

source: %@ used
zh_hans: 已用 %@

source: %d MB (~%@ lines)
zh_hans: %d MB(约 %@ 行)

source: %d of its panes still have something running; everything in this workspace will be terminated.
zh_hans: 其中 %d 个面板仍有任务在运行,该工作区里的所有内容都会被终止。

source: %d panes still have something running; quitting will terminate all of them.
zh_hans: 还有 %d 个面板有任务在运行,退出会全部终止。

source: %lld files
zh_hans: %lld 个文件

source: %lld new upstream commits
zh_hans: 上游有 %lld 个新提交

source: 1 file
zh_hans: 1 个文件

source: 1 hour
zh_hans: 1 小时

source: 1 minute
zh_hans: 1 分钟

source: 1 new upstream commit
zh_hans: 上游有 1 个新提交

source: 1 pane still has something running; quitting will terminate it.
zh_hans: 还有 1 个面板有任务在运行,退出会将其终止。

source: 10 minutes
zh_hans: 10 分钟

source: 15 minutes
zh_hans: 15 分钟

source: 30 minutes
zh_hans: 30 分钟

source: 5 minutes
zh_hans: 5 分钟

source: A named entry in the hooks document agy shares between TUI and backend. Only reports when Glint's pane environment variables are present, so an agy session outside Glint is a no-op.
zh_hans: agy 的 TUI 与后端共享的 hooks 文档中的一个命名条目。仅在存在 Glint 窗格环境变量时才上报，因此在 Glint 之外运行的 agy 会话不会受影响。

source: A native mac terminal made for AI agents.
zh_hans: 为 AI 代理打造的原生 Mac 终端。

source: ACTION
zh_hans: 动作

source: AHEAD / BEHIND
zh_hans: 领先 / 落后

source: About
zh_hans: 关于

source: Accent
zh_hans: 强调色

source: Access URL
zh_hans: 访问地址

source: Access key
zh_hans: 访问密钥

source: Access key and ports reset
zh_hans: 访问密钥和端口已重置

source: Add
zh_hans: 添加

source: Adds a fenced block to ~/.zshrc that loads zsh-autosuggestions from ~/.config/glint. Only affects newly spawned zsh panes; bash / fish are untouched.
zh_hans: 向 ~/.zshrc 追加一小段受 Glint 管理的代码块，从 ~/.config/glint 加载 zsh-autosuggestions。仅对新开的 zsh 面板生效，不影响 bash / fish。

source: Advanced
zh_hans: 高级

source: Agent finished its turn
zh_hans: 任务已完成

source: Agent is waiting for your reply
zh_hans: Agent 等待你的回复

source: Agent's turn ended in an error
zh_hans: 运行出错

source: Agents
zh_hans: 代理

source: All installed fonts
zh_hans: 所有系统字体

source: All installed monospaced
zh_hans: 所有等宽字体

source: All interfaces (less secure)
zh_hans: 全部网卡（较不安全）

source: Allow
zh_hans: 允许

source: Allow Glint to execute "%@"?
zh_hans: 允许 Glint 执行 "%@"?

source: Allow browser control
zh_hans: 允许浏览器控制

source: Allow external control
zh_hans: 允许外部控制

source: Already used by “%@”.
zh_hans: 已用于「%@」。

source: Always skip permission prompts on resume
zh_hans: 恢复时总是跳过权限确认

source: Antigravity CLI detected — install the hook entry to show its status.
zh_hans: 检测到 Antigravity CLI —— 安装 hook 条目即可显示其状态。

source: Antigravity CLI not detected on this Mac.
zh_hans: 未在本机检测到 Antigravity CLI。

source: App icon
zh_hans: 应用图标

source: Appearance
zh_hans: 外观

source: Apply
zh_hans: 应用

source: Archive
zh_hans: 归档

source: Archive Workspace
zh_hans: 归档工作区

source: Archived
zh_hans: 已归档

source: Archived workspaces
zh_hans: 已归档工作区

source: Archived workspaces leave the sidebar but keep their panes and scrollback. Use Archive from a workspace’s context menu, or the Archive Workspace shortcut (default ⌘0).
zh_hans: 归档的工作区会离开侧栏，但保留分屏与滚动缓冲。可在工作区右键菜单选择归档，或使用归档快捷键（默认 ⌘0）。

source: Ask first when the clipboard contains newlines or control characters — a multi-line paste into a shell prompt runs each line immediately.
zh_hans: 当剪贴板包含换行或控制字符时先询问——多行内容粘贴到 shell 提示符会立刻逐行执行。

source: Ask which agent to launch
zh_hans: 新建时询问启动哪个 Agent

source: Auth
zh_hans: 认证

source: Auto-compact tracking
zh_hans: 自动压缩追踪

source: Auto-discovered TypeScript extension under pi's global extensions directory; only reports when Glint's pane environment variables are present.
zh_hans: pi 全局扩展目录下自动发现的 TypeScript 扩展;仅当 Glint 的窗格环境变量存在时才上报。

source: Auto-name new workspaces
zh_hans: 自动命名新建工作区

source: Auto-update
zh_hans: 自动更新

source: Auto-update is not wired yet. Pull main and rebuild for now.
zh_hans: 自动更新尚未接入,现阶段请拉取 main 重新编译。

source: BRANCH
zh_hans: 分支

source: Background blur
zh_hans: 背景模糊

source: Bar
zh_hans: 竖线

source: Beta
zh_hans: Beta 版

source: Beta channel
zh_hans: Beta 通道

source: Binary file — no text diff
zh_hans: 二进制文件 — 无文本差异

source: Blink
zh_hans: 闪烁

source: Block
zh_hans: 方块

source: Bold
zh_hans: 加粗

source: Branch vs %@
zh_hans: 分支 vs %@

source: Bring these changes into the new worktree
zh_hans: 把这些改动一并带进新工作树

source: Browse all %lld themes
zh_hans: 浏览全部 %lld 套主题

source: Browse…
zh_hans: 浏览…

source: Bubble workspaces whose agent just finished a turn to the top of the sidebar. Sinks back when you open it.
zh_hans: Agent 刚完成一轮的工作区会浮到侧栏顶部,打开后会落回原位。

source: Buffer
zh_hans: 缓冲区

source: Build
zh_hans: 构建

source: Build channel
zh_hans: 构建通道

source: CHANGES
zh_hans: 变更

source: CJK fallback
zh_hans: 中文字体兜底

source: Cancel
zh_hans: 取消

source: Card
zh_hans: 卡片

source: Change file list layout
zh_hans: 切换文件列表布局

source: Changes Only
zh_hans: 仅显示改动

source: Channel
zh_hans: 通道

source: Check
zh_hans: 检查

source: Check GitHub Releases, then download, unquarantine, replace, and restart in one step.
zh_hans: 检查 GitHub Releases，然后一键完成下载、去隔离、覆盖安装并重启。

source: Check for updates automatically
zh_hans: 自动检查更新

source: Check now
zh_hans: 立即检查

source: Checked %@
zh_hans: 检查于 %@

source: Checking for updates…
zh_hans: 正在检查更新…

source: Checking the branch name…
zh_hans: 正在校验分支名…

source: Chimes only fire for background workspaces — the one you're looking at stays quiet.
zh_hans: 提示音只在后台工作区触发,你正在查看的工作区保持安静。

source: Claude Code detected — install the reporter to show its status.
zh_hans: 已检测到 Claude Code —— 安装上报脚本即可显示其状态。

source: Claude Code not detected on this Mac.
zh_hans: 本机未检测到 Claude Code。

source: Claude Code, Codex, OMP, Grok, Pi, hook routing
zh_hans: Claude Code、Codex、OMP、Grok、Pi、hook 路由

source: Claude Code, Codex, OMP, Grok, hook routing
zh_hans: Claude Code、Codex、OMP、Grok、hook 路由

source: Claude Code, Codex, OMP, hook routing
zh_hans: Claude Code、Codex、OMP、hook 路由

source: Claude Code, Codex, hook routing
zh_hans: Claude Code、Codex、Hook 路由

source: Clear
zh_hans: 清屏

source: Clear filter
zh_hans: 清除筛选

source: Click a shortcut, then press the new keys. ⌘↑ / ⌘↓ and bare ⌘F stay unbound so they reach the terminal.
zh_hans: 点击快捷键后按下新的组合键。⌘↑ / ⌘↓ 与单独的 ⌘F 故意不绑定，以便传给终端。

source: Click a workspace card with the middle mouse button to close it. Same as the context menu's “Close Workspace”.
zh_hans: 用鼠标中键点击工作区卡片即可关闭,等同于右键菜单的「关闭工作区」。

source: Click, then press a new shortcut
zh_hans: 点击后按下新的快捷键

source: Close (Esc)
zh_hans: 关闭 (Esc)

source: Close Other Tabs
zh_hans: 关闭其他标签页

source: Close Palette
zh_hans: 关闭面板

source: Close Pane
zh_hans: 关闭面板

source: Close Tab
zh_hans: 关闭标签页

source: Close Tabs
zh_hans: 关闭标签页

source: Close Workspace
zh_hans: 关闭工作区

source: Close and Remove Worktree…
zh_hans: 关闭并移除工作树…

source: Close other tabs?
zh_hans: 关闭其他标签页?

source: Close the focused pane
zh_hans: 关闭当前面板

source: Close this pane?
zh_hans: 关闭这个面板?

source: Close this tab?
zh_hans: 关闭这个标签页?

source: Codex Home Directories
zh_hans: Codex Home 目录

source: Codex Home stores local auth, config, sessions, and hooks. Glint only installs its own hooks and reads status; Codex continues to manage authentication and configuration. The checkbox only controls monitoring and sidebar display — unchecking a Home keeps its installed hooks; use Remove Hook to uninstall.
zh_hans: Codex Home 存放本地认证、配置、会话和钩子。Glint 只安装自己的钩子并读取状态;认证与配置仍由 Codex 管理。复选框只控制监控和侧栏显示——取消勾选会保留已安装的钩子,如需卸载请用 Remove Hook。

source: Codex detected — install the reporter to show its status.
zh_hans: 已检测到 Codex —— 安装上报脚本即可显示其状态。

source: Codex not detected on this Mac.
zh_hans: 本机未检测到 Codex。

source: Collapse sidebar on launch
zh_hans: 启动时折叠侧栏

source: Color scheme
zh_hans: 配色方案

source: Comfortable
zh_hans: 舒适

source: Command
zh_hans: 命令

source: Command Palette
zh_hans: 命令面板

source: Command Palette (⌘⇧P)
zh_hans: 命令面板 (⌘⇧P)

source: Command suggestions
zh_hans: 命令提示

source: Compact
zh_hans: 紧凑

source: Connected browsers will be disconnected. A new key and ports will be generated, so old links will stop working.
zh_hans: 已连接的浏览器将断开。系统会生成新密钥和端口，旧链接将失效。

source: Controlled from web
zh_hans: 正在通过网页控制

source: Copied in; your original checkout keeps them too.
zh_hans: 已复制进去;原始检出里也照常保留。

source: Copy
zh_hans: 拷贝

source: Copy Path
zh_hans: 拷贝路径

source: Copy key
zh_hans: 复制密钥

source: Copy link
zh_hans: 复制链接

source: Copy the focused pane's directory
zh_hans: 拷贝当前面板所在目录

source: Could not create the Codex Home directory: %@
zh_hans: 无法创建 Codex Home 目录:%@

source: Could not create the Glint reporter script.
zh_hans: 无法创建 Glint 上报脚本。

source: Could not read hooks.json: %@
zh_hans: 无法读取 hooks.json:%@

source: Could not start: %@
zh_hans: 无法启动：%@

source: Could not write hooks.json: %@
zh_hans: 无法写入 hooks.json:%@

source: Couldn't find Glint.app inside the downloaded DMG.
zh_hans: 下载的 DMG 中找不到 Glint.app。

source: Couldn't remove the worktree
zh_hans: 无法移除工作树

source: Count background panes that need approval, just finished, or failed.
zh_hans: 统计需要批准、刚完成或失败的后台面板。

source: Create Workspace
zh_hans: 创建工作区

source: Create Worktree
zh_hans: 创建工作树

source: Create a fresh workspace
zh_hans: 创建一个新工作区

source: Creates branch + worktree; original checkout stays put.
zh_hans: 创建分支 + 工作树;原始检出保持不动。

source: Creating…
zh_hans: 正在创建…

source: Current
zh_hans: 当前

source: Current version: %@
zh_hans: 当前版本：%@

source: Cursor
zh_hans: 光标

source: Customize and save shortcuts
zh_hans: 自定义并保存快捷键

source: Cut an isolated branch + worktree from a repo
zh_hans: 从仓库切出隔离的分支 + 工作树

source: Cut an isolated branch + worktree off an existing repo. Your original checkout is untouched.
zh_hans: 从已有仓库切出一个隔离的分支 + 工作树。你的原始检出保持不变。

source: Cycle pane focus within this workspace
zh_hans: 在工作区内循环切换面板

source: Dark
zh_hans: 深色

source: Dedicated Glint hook file under Grok's global hooks directory; only reports when Glint's pane environment variables are present.
zh_hans: Grok 全局 hooks 目录下的独立 Glint hook 文件；仅在存在 Glint 窗格环境变量时上报。

source: Default
zh_hans: 默认

source: Default: ~/glint/worktrees/<repo>/<branch-slug> — discoverable in Finder.
zh_hans: 默认:~/glint/worktrees/<repo>/<branch-slug>——可在访达中找到。

source: Delete Workspace
zh_hans: 删除工作区

source: Delete Worktree and Branch
zh_hans: 删除工作树和分支

source: Delete Worktree, Keep Branch
zh_hans: 删除工作树,保留分支

source: Delete Worktree…
zh_hans: 删除工作树…

source: Delete the worktree directory (confirm required)
zh_hans: 删除工作树目录(需确认)

source: Delete worktree for %@?
zh_hans: 删除 %@ 的工作树?

source: Delete “%@”?
zh_hans: 删除“%@”?

source: Density
zh_hans: 密度

source: Derive a name from the focused pane's cwd until you rename.
zh_hans: 在你手动重命名之前,从聚焦面板的工作目录推导名称。

source: Devin detected — install the reporter to show its status.
zh_hans: 已检测到 Devin —— 安装报告器即可显示其状态。

source: Devin not detected on this Mac.
zh_hans: 本机未检测到 Devin。

source: Diff truncated — %lld more lines
zh_hans: 差异已截断 — 还有 %lld 行

source: Directory does not exist. Installing the hook will create it.
zh_hans: 目录不存在。安装钩子时会创建它。

source: Disabled
zh_hans: 已停用

source: Disabling vibrancy can help on older Macs.
zh_hans: 在旧款 Mac 上关闭毛玻璃可能更流畅。

source: Display Claude's 5-hour and weekly limits in the sidebar. Reads Claude Code's login token from the keychain.
zh_hans: 在侧边栏显示 Claude 的 5 小时和每周额度。会从钥匙串读取 Claude Code 的登录凭据。

source: Display Codex's 5-hour and weekly limits in the sidebar.
zh_hans: 在侧边栏显示 Codex 的 5 小时和每周额度。

source: Display Grok's weekly usage credits in the sidebar. Reads the token `grok login` keeps in ~/.grok. Team plans get no numbers from xAI's billing surface — the row then shows the window's reset countdown with a “—” in place of a percent.
zh_hans: 在侧栏显示 Grok 的每周用量积分。读取 `grok login` 存在 ~/.grok 的令牌。团队套餐在 xAI 计费接口上没有数字 —— 此时该行显示窗口重置倒计时，百分比位置为“—”。

source: Display available enabled Codex Home usage in the sidebar.
zh_hans: 在侧栏显示已启用 Codex Home 的可用额度。

source: Display language for Glint's UI.
zh_hans: Glint 界面的显示语言。

source: Dock badges and chimes only update for background workspaces — the one you're looking at stays quiet.
zh_hans: Dock 角标和提示音只在后台工作区更新,你正在查看的工作区保持安静。

source: Don't ask again
zh_hans: 不再询问

source: Download & Install
zh_hans: 下载并安装

source: Download checksum mismatch. Please try again.
zh_hans: 下载校验和不匹配，请重试。

source: Downloading update…
zh_hans: 正在下载更新…

source: Downloads the latest DMG from this fork's GitHub Releases, removes quarantine, replaces the app, and restarts. No Apple Developer certificate required.
zh_hans: 从本 fork 的 GitHub Releases 下载最新 DMG，自动去隔离、覆盖安装并重启。无需 Apple 开发者证书。

source: Enable glass effect
zh_hans: 开启毛玻璃

source: Enter a Codex Home path.
zh_hans: 请输入 Codex Home 路径。

source: Enter a name for the new branch.
zh_hans: 请先填写新分支的名称。

source: Events
zh_hans: 事件

source: Exposes a local socket under ~/.glint/run/ so other apps on this Mac can focus panes and inject text/keys. Any process that can read the 0600 token file may drive your terminals — off by default. Toggling takes effect immediately.
zh_hans: 在 ~/.glint/run/ 下开放一个本地 socket,让本机其它程序可以聚焦 pane、注入文本/按键。任何能读取 0600 token 文件的进程都能操控你的终端 —— 默认关闭。开关即时生效。

source: Extension file
zh_hans: 扩展文件

source: Extension installed and registered with OMP.
zh_hans: 扩展已安装并注册到 OMP。

source: Extension installed into your pi extensions directory.
zh_hans: 扩展已安装到你的 pi 扩展目录。

source: External control
zh_hans: 外部控制

source: Family
zh_hans: 字体

source: Fastest · no repo
zh_hans: 最快 · 无仓库

source: Fewer context lines
zh_hans: 减少上下文行数

source: Filter
zh_hans: 筛选

source: Find in Sidebar
zh_hans: 在侧栏中搜索

source: Float just-completed to top
zh_hans: 刚完成的置顶

source: Focus Next Pane
zh_hans: 聚焦下一面板

source: Focus the next pane that needs you
zh_hans: 聚焦到下一个需要你的面板

source: Follow system
zh_hans: 跟随系统

source: Font
zh_hans: 字体

source: Font, cursor, scrollback
zh_hans: 字体、光标、滚动

source: For plain workspaces whose pane is inside a git repo, reveal the repository root instead of the current directory.
zh_hans: 对于面板位于 git 仓库内的普通工作区，显示仓库根目录而非当前目录。

source: For plain workspaces whose pane is inside a git repo, review the whole repository instead of just the current directory's subtree.
zh_hans: 对于面板位于 git 仓库内的普通工作区，审查整个仓库而非仅当前目录的子树。

source: Found
zh_hans: 已找到

source: Free idle terminals
zh_hans: 释放空闲终端

source: General
zh_hans: 通用

source: Get pre-release builds early. Beta builds ship new work before it has fully settled.
zh_hans: 提前收到预发布版本。Beta 版本包含尚未完全稳定的新功能。

source: Ghostty limits scrollback by memory size. Line counts are estimates and vary with pane width and content.
zh_hans: Ghostty 按内存大小限制滚动记录。行数只是估算,会随面板宽度和内容变化。

source: Git status
zh_hans: Git 状态

source: GitHub returned HTTP %lld.
zh_hans: GitHub 返回 HTTP %lld。

source: Glass effect
zh_hans: 毛玻璃

source: Glint auto-installs a reporter into ~/.claude/settings.json on launch. Existing hooks are preserved.
zh_hans: Glint 启动时会自动把上报脚本合并进 ~/.claude/settings.json,已有 hook 会被保留。

source: Glint can only run files with the executable bit set.
zh_hans: Glint 只能运行设置了可执行权限的文件。

source: Glint can register a small hook with Claude Code (~/.claude/settings.json) and Codex (~/.codex/hooks.json) that reports when an agent is thinking, finished, or waiting for approval. It only sends events to Glint on this Mac. You can uninstall it anytime in Settings → Agents.
zh_hans: Glint 可以向 Claude Code(~/.claude/settings.json)和 Codex(~/.codex/hooks.json)注册一个小 hook,上报 agent 正在思考、已完成或等待批准的状态。事件只会发送给这台 Mac 上的 Glint,随时可在 设置 → Agents 中卸载。

source: Glint can register status hooks with %@ that report when an agent is thinking, finished, or waiting for approval. They only send events to Glint on this Mac. You can uninstall them anytime in Settings → Agents.
zh_hans: Glint 可以为 %@ 注册状态 hook，在 agent 思考中、已完成或等待批准时上报。事件只会发送到本机的 Glint。你随时可以在「设置 → Agents」里卸载。

source: Glint installs a TypeScript extension into ~/.pi/agent/extensions/ so pi sessions report thinking, tools, and ask_user_question (awaiting reply). Auto-discovered by pi on every session — no settings merge needed. Only fires when Glint's pane environment variables are present, so a pi session outside Glint is a no-op.
zh_hans: Glint 将一个 TypeScript 扩展安装到 ~/.pi/agent/extensions/,使 pi 会话上报思考、工具调用及 ask_user_question(等待回复)状态。pi 会在每次会话时自动发现该扩展 —— 无需合并设置。仅在 Glint 窗格环境变量存在时触发,因此 Glint 之外的 pi 会话不受影响。

source: Glint installs a global OpenCode plugin at ~/.config/opencode/plugins/glint-agent-bridge.js so OpenCode sessions can report status without being shown as Claude.
zh_hans: Glint 会在 ~/.config/opencode/plugins/glint-agent-bridge.js 安装一个全局 OpenCode 插件，让 OpenCode 会话能上报状态、而不被显示成 Claude。

source: Glint installs a portable TypeScript extension at ~/.glint/hooks/omp-agent-bridge.ts and registers that path in ~/.omp/agent/settings.json so Oh My Pi sessions report status like Claude. Uses a tilde path (not an absolute home path) so the same install works on any Mac.
zh_hans: Glint 会在 ~/.glint/hooks/omp-agent-bridge.ts 安装可移植的 TypeScript 扩展，并在 ~/.omp/agent/settings.json 中注册该路径，使 Oh My Pi 会话像 Claude 一样上报状态。使用波浪线路径（而非绝对 home 路径），同一套安装在任意 Mac 上都能生效。

source: Glint is dark-mode only for now.
zh_hans: Glint 目前仅支持深色模式。

source: Glint merges its hook entries into ~/.config/devin/config.json so Devin CLI sessions surface the same status as Claude.
zh_hans: Glint 会将钩子条目合并到 ~/.config/devin/config.json，使 Devin CLI 会话能像 Claude 一样显示状态。

source: Glint registers a named hook entry ("glint") in the hooks.json the Antigravity CLI (agy) shares between its TUI and backend, so sessions report thinking, tool calls, and turn completion. Every other hook in that file is preserved; uninstall removes only Glint's entry. Approval prompts stay in agy's own UI (it has no permission hook), so panes never show a needs-approval state.
zh_hans: Glint 会在 Antigravity CLI（agy）的 TUI 与后端共享的 hooks.json 里注册一个命名条目（"glint"），让会话上报思考中、工具调用和回合结束。该文件中的其它 hook 全部保留；卸载只移除 Glint 的条目。审批确认保留在 agy 自己的界面里（它没有权限 hook），因此窗格不会显示「等待确认」状态。

source: Glint uses Sparkle to check the GitHub Releases feed and install updates in place.
zh_hans: Glint 使用 Sparkle 检查 GitHub Releases 并原地安装更新。

source: Glint will look for new releases in the background.
zh_hans: Glint 会在后台查找新版本。

source: Glint will run this file in a shell at its parent directory.
zh_hans: Glint 将在其父目录的 shell 中运行此文件。

source: Glint writes its hook entries into ~/.codex/hooks.json so codex sessions surface the same status as Claude.
zh_hans: Glint 会把 hook 写入 ~/.codex/hooks.json,让 codex 会话与 Claude 一样上报状态。

source: Glint writes ~/.grok/hooks/glint.json so Grok Build sessions report thinking, tools, and ask_user_question (awaiting reply). Dedicated file — not Claude's settings — so Grok is attributed as Grok. The reporter ignores Claude-compat dual-fires under Grok (GROK_SESSION_ID present).
zh_hans: Glint 会写入 ~/.grok/hooks/glint.json，使 Grok Build 会话上报思考、工具调用，以及 ask_user_question（待回复）。使用独立文件（而非 Claude 的 settings），因此 Grok 会话会正确归到 Grok。在 Grok 下 reporter 会忽略 Claude 兼容 hooks 的双触发（存在 GROK_SESSION_ID 时）。

source: Got it
zh_hans: 知道了

source: Grok detected — install the reporter to show its status.
zh_hans: 已检测到 Grok — 安装 reporter 即可显示其状态。

source: Grok not detected on this Mac.
zh_hans: 本机未检测到 Grok。

source: Hide Glint
zh_hans: 隐藏 Glint

source: Hide New Files
zh_hans: 隐藏新增文件

source: Hide Sidebar
zh_hans: 隐藏侧栏

source: History-driven autosuggestions (zsh)
zh_hans: 历史命令自动补全（zsh）

source: Hook
zh_hans: 钩子

source: Hook bridge not yet implemented.
zh_hans: Hook 桥接尚未实现。

source: Hook config
zh_hans: Hook 配置

source: Hook entry merged into ~/.gemini/config/hooks.json.
zh_hans: Hook 条目已合并进 ~/.gemini/config/hooks.json。

source: Hook script
zh_hans: Hook 脚本

source: Hooks Glint reacts to from Claude Code.
zh_hans: Glint 监听的 Claude Code Hook。

source: Hooks are stored in Devin's native user config alongside your existing settings.
zh_hans: 钩子存储在 Devin 的原生用户配置中，与你现有的设置并列。

source: Hooks installed into your Grok hooks directory.
zh_hans: Hook 已安装到你的 Grok hooks 目录。

source: Hooks merged into your Claude settings.
zh_hans: Hook 已合并到你的 Claude 配置。

source: Hooks merged into your Codex config.
zh_hans: Hook 已合并到你的 Codex 配置。

source: Hooks merged into your Devin config.
zh_hans: 钩子已合并到你的 Devin 配置中。

source: How Claude panes are drawn in the sidebar and tabs.
zh_hans: Claude 在侧栏和标签页中使用的图标样式。

source: Icon style
zh_hans: 图标样式

source: Idle terminal released
zh_hans: 空闲终端已释放

source: Ignore Whitespace
zh_hans: 忽略空白

source: In Command Palette
zh_hans: 命令面板内

source: Include pre-release builds
zh_hans: 包含预发布构建

source: Install
zh_hans: 安装

source: Install %@, remove quarantine, replace this app, and restart.
zh_hans: 安装 %@，去除隔离、覆盖本应用并重启。

source: Install Hook
zh_hans: 安装钩子

source: Install Hooks
zh_hans: 安装 Hook

source: Install failed — check Console for [glint] logs.
zh_hans: 安装失败 —— 请在「控制台」中查看 [glint] 日志。

source: Install update
zh_hans: 安装更新

source: Installed
zh_hans: 已安装

source: Installed — open a new shell for it to take effect.
zh_hans: 已安装 —— 新开一个 shell 后生效。

source: Installing update…
zh_hans: 正在安装更新…

source: Interface opacity
zh_hans: 界面透明度

source: Invalid auth.json
zh_hans: auth.json 无效

source: Invalid hooks.json
zh_hans: hooks.json 无效

source: Invalid hooks.json. The file was not modified.
zh_hans: hooks.json 无效,文件未被修改。

source: Isolated branch
zh_hans: 隔离的分支

source: Jump to Attention
zh_hans: 跳转到待处理项

source: Keep Glint's speed — no repo, no branch, just a shell.
zh_hans: 保持 Glint 的速度——无仓库、无分支,只有一个 shell。

source: Keyboard reference
zh_hans: 键盘参考

source: LAST COMMIT
zh_hans: 最近提交

source: Label (optional)
zh_hans: 标签(可选)

source: Language
zh_hans: 语言

source: Last modified
zh_hans: 最近修改

source: Layout may be inaccurate while controlled. It will restore automatically after disconnecting.
zh_hans: 控制期间布局可能不准确，断开后会自动恢复。

source: Left in your original checkout; the worktree starts clean at base's HEAD.
zh_hans: 留在原始检出里;工作树从 base 的 HEAD 干净切出。

source: Let the desktop show through — the terminal area and the sidebar/toolbar can be tuned separately. Background blur frosts the desktop behind the window so terminal text stays readable. Note: macOS native fullscreen disables window transparency.
zh_hans: 让桌面从背后透出 —— 终端区与侧栏/工具栏可分开调。背景模糊把透出的桌面磨砂虚化,终端文字更易读。注:macOS 原生全屏下系统会禁用窗口透明。

source: Lines retained per pane.
zh_hans: 每个面板保留的行数。

source: Listen on
zh_hans: 监听网卡

source: Listening for external commands.
zh_hans: 正在监听外部命令。

source: Loaded by OpenCode automatically on startup; it only reports when Glint's pane environment variables are present.
zh_hans: OpenCode 启动时自动加载；仅当存在 Glint 的窗格环境变量时才会上报。

source: Loading…
zh_hans: 加载中…

source: Local Dev
zh_hans: 本地开发

source: Local Repo
zh_hans: 本地仓库

source: Local Worktree
zh_hans: 本地工作树

source: Localhost only
zh_hans: 仅本机

source: Managed by macOS — not customizable here.
zh_hans: 由 macOS 管理，此处不可自定义。

source: Manually look for a new release right now.
zh_hans: 立即手动查找新版本。

source: Memory
zh_hans: 内存

source: Memory budget per pane.
zh_hans: 每个面板的内存预算。

source: Middle-click closes workspace
zh_hans: 中键关闭工作区

source: Minimize
zh_hans: 最小化

source: Missing
zh_hans: 缺失

source: Monitor this Home and show its usage in the sidebar. Unchecking stops monitoring but keeps any installed hooks.
zh_hans: 监控该 Home 并在侧栏显示其额度。取消勾选只停止监控,已安装的钩子会保留。

source: More context lines
zh_hans: 增加上下文行数

source: Move Selection Down
zh_hans: 下移选项

source: Move Selection Up
zh_hans: 上移选项

source: Need parallel agents that don't touch your checkout? Use Local Worktree instead.
zh_hans: 需要并行 agent 又不动你的检出?改用本地工作树。

source: New Local Worktree
zh_hans: 新建本地工作树

source: New Tab
zh_hans: 新建标签页

source: New Tab (⌘T)
zh_hans: 新建标签页(⌘T)

source: New Tab · %@
zh_hans: 新建标签页 · %@

source: New Workspace
zh_hans: 新建工作区

source: New Workspace · %@
zh_hans: 新建工作区 · %@

source: New Worktree Workspace
zh_hans: 新建工作树工作区

source: New Worktree from Here…
zh_hans: 从此处新建工作树…

source: New branch
zh_hans: 新分支
